describe('ルート', () => {
  it.todo('/ にアクセスした際、目次画面が表示されること')
  it.todo('/rec にアクセスした際、録画画面が表示されること')
  it.todo('/play にアクセスした際、再生画面が表示されること')
})

describe('全体', () => {
  it.todo('録画中の状態がわかりやすく表示されること')
  it.todo('録画状態を ON/OFF できる手段を有すること')
})

describe('目次画面', () => {
  it.todo('録画画面へ遷移する手段を有すること')
  it.todo('再生画面へ遷移する手段を有すること')
})

describe('録画画面', () => {
  it.todo('利用可能なチャンネルが一覧表示されること')
  it.todo('画面キャプチャチャンネルを追加する手段を有すること')
  it.todo('オーディオ、ビデオの対がわかるように表示されること')
  it.todo('チャンネルごとに録画状態を ON/OFF できる手段を有すること')
  it.todo('チャンネルごとの録画状態は、可能な限り維持すること')
  it.todo('チャンネルごとにプレビューが表示されること')
  it.todo('チャンネルごとのプレビューを ON/OFF できる手段を有すること')
})
