describe('ルート', () => {
  it.todo('/ にアクセスした際、目次画面が表示されること')
  it.todo('/cast にアクセスした際、配信画面が表示されること')
  it.todo('/watch にアクセスした際、視聴画面が表示されること')
})

describe('全体', () => {
  it.todo('配信中の状態がわかりやすく表示されること')
  it.todo('配信状態を ON/OFF できる手段を有すること')
})

describe('目次画面', () => {
  it.todo('配信画面へ遷移する手段を有すること')
  it.todo('視聴画面へ遷移する手段を有すること')
})

describe('配信画面', () => {
  it.todo('配信可能なチャンネルが一覧表示されること')
  it.todo('画面キャプチャチャンネルを追加する手段を有すること')
  it.todo('オーディオ、ビデオの対がわかるように表示されること')
  it.todo('チャンネルごとに配信状態を ON/OFF できる手段を有すること')
  it.todo('チャンネルごとの配信状態は、可能な限り維持すること')
  it.todo('チャンネルごとにプレビューが表示されること')
  it.todo('チャンネルごとのプレビューを ON/OFF できる手段を有すること')
})

describe('視聴画面', () => {
  it.todo('視聴可能なチャンネルが一覧表示されること')
  it.todo('オーディオ、ビデオの対がわかるように表示されること')
  it.todo('チャンネルごとに視聴状態を ON/OFF できる手段を有すること')
  it.todo('チャンネルごとの視聴状態は、可能な限り維持すること')
})
